Repository: derrickkim0109/RxSwift
Catalog: 2021.03.12_Tutorial01_Rxmarbles/RxMarbles/RxMarbles/*.lproj/Localizable.strings
Languages: ru

source: Operators
ru: Операторы

source: Edit. Learn. Experiment.
ru: Редактируй. Изучай. Эксперементируй.

source: Add new, change colors and values in
ru: Добавляй новое, меняй цвета и значения в

source: move events around
ru: перемещай события

# help_button_title
source: Help
ru: Помощь

# operators_to
source: RX operators to
ru: RX операторов для

source: explore
ru: исследования

source: Share your diagrams
ru: Делись своими схемами

# spread_the_world
source: Spread the word
ru: Делись информацией

# amb
source: Given two or more source Observables, emit all of the items from only the first of these Observables to emit an item or notification.
ru: Из всех Observable в результирующий попадают только элементы того, что первый начинает их генерировать, остальные игнорируются.

# buffer
source: Periodically gather items emitted by an Observable into bundles and emit these bundles rather than emitting the items one at a time.
ru: Периодически собирает элементы Observable в стеки и отдает их (не отдает элементы Observable по одному).

# catchError
source: Recover from an onError notification by continuing the sequence without error.
ru: Позволяет перехватить ошибку сгенерированную Observable и заменить ее на новый Observable.

# catchErrorJustReturn
source: Recover from an onError notification by continuing the sequence without error.
ru: Позволяет перехватить ошибку сгенерированную Observable и заменить ее на новый Observable.

# withLatestFrom
source: When an item is emitted by either of two Observables, combine the latest item emitted by each Observable via a specified function and emit items based on the results of this function.
ru: Как только первый Observable генерирует элемент, проверяется, сгенерирован ли хоть один элемент во втором Observable, и если да, то берутся последние элементы из первого Observable и второго Observable и используются в качестве аргументов для переданной функции, результат которой генерируется результирующий Observable в качестве элемента.

# combineLatest
source: When an item is emitted by either of two Observables, combine the latest item emitted by each Observable via a specified function and emit items based on the results of this function.
ru: Когда элемент испускается одним из двух Observable, объединяет последний элемент, испускаемый каждым Observable с помощью указанной функции и испускает элемент на основе результатов этой функции.

# concat
source: Emit the emissions from two or more Observables without interleaving them.
ru: Испускает event'ы от двух или более Observable без их чередования

# throttle
source: Emit the first and the latest item emitted by the source Observable during sequential time windows of a specified duration.
ru: Испускает первый и последний элемент Observable в течение последовательного промежутка времени.

# debounce
source: Only emit an item from an Observable if a particular timespan has passed without it emitting another item.
ru: Испускает элементы Observable если только прошел заданный промежуток времени с последнего emit'а.

# delaySubscription
source: Shift the emissions from an Observable forward in time by a particular amount.
ru: Устанавливает задержку на emit элементов у Observable.

# distinctUntilChanged
source: Suppress duplicate items emitted by an Observable.
ru: Убирает повторяемые элементы, которые emit'ит Observable.

# elementAt
source: Emit only item n emitted by an Observable.
ru: Emit'ить только элемент n.

# empty
source: Create an Observable that emits no items but terminates normally.
ru: Создает Observable, который не emit'ит элементы.

# filter
source: Emit only those items from an Observable that pass a predicate test.
ru: Emit'ит только те элементы Observable, что проходят тест предиката.

# flatMap
source: Transform the items emitted by an Observable into Observables, then flatten the emissions from those into a single Observable.
ru: Преобразует элементы всех Observable и объединяет в один Observable.

# flatMapFirst
source: Transform the items emitted by an Observable into Observables, then flatten the emissions from those into a single Observable.
ru: Преобразует элементы всех Observable и объединяет в один Observable.

# flatMapLatest
source: Transform the items emitted by an Observable into Observables, then flatten the emissions from those into a single Observable.
ru: Преобразует элементы всех Observable и объединяет в один Observable.

# ignoreElements
source: Do not emit any items from an Observable but mirror its termination notification.
ru: Не emit'ить какие-либо элементы из Observable, но отображать его уведомление о прекращении.

# interval
source: Create an Observable that emits a sequence of integers spaced by a given time interval.
ru: Создает бесконечную последовательность, возрастающую с 0 с шагом 1 с указанной периодичностью.

# just
source: Create an Observable that emits a particular item.
ru: Cоздает Observable, который генерирует только один элемент.

# map
source: Transform the items emitted by an Observable by applying a function to each item.
ru: Преобразует элементы Observable применяя к ним заданную функцию.

# mapWithIndex
source: Transform the items emitted by an Observable by applying a function to each item.
ru: Преобразует элементы Observable применяя к ним заданную функцию, отличие от map в том, что в функцию передается еще один элемент, а именно индекс сгенерированного элемента.

# merge
source: Combine multiple Observables into one by merging their emissions.
ru: Объединяет несколько Observable в один, элементы идут в том порядке, в котором были отправлены.

# never
source: Create an Observable that emits no items and does not terminate.
ru: Пустая последовательность, чьи observer'ы никогда не вызовутся, то есть не будет сгенерировано ни одно событие.

# of
source: Convert various other objects and data types into Observables.
ru: Последовательность из переменного количества элементов. После всех элементов генерируется Completed.

# reduce
source: Apply a function to each item emitted by an Observable, sequentially, and emit the final value.
ru: Применяет функцию к каждому элементу, после чего отправляет конечное значение.

# repeatElement
source: Create an Observable that emits a particular item multiple times.
ru: Бесконечно создает указанный элемент, без задержек. Никогда не будут сгенерированы события Completed или Error.

# retry
source: If a source Observable emits an error, resubscribe to it in the hopes that it will complete without error.
ru: Позволяет перехватить сгенерированную ошибку из Obseervable и в зависимости от переданного параметра попытаться запустить Observable c начала нужное число раз в надежде, что ошибка не повторится.

# sample
source: Emit the most recent items emitted by an Observable within periodic time intervals.
ru: Emit'ит самые последние элементы, Observable в течение временных интервалов.

# single
source: Emit only the first item (or the first item that meets some condition) emitted by an Observable.
ru: Из исходной последовательности берется единственный элемент, если элементов больше 1, то генерируется ошибка.

# skipDuration
source: Suppress the first n items emitted by an Observable.
ru: Пропустить первые n элементов Observable.

# skip
source: Suppress the first n items emitted by an Observable.
ru: Пропустить первые n элементов Observable.

# skipUntil
source: Discard items emitted by an Observable until a second Observable emits an item.
ru: Пропусткает элементы Observable до тех пор пока второй Observable не начнет посылать элементы.

# skipWhile
source: Discard items emitted by an Observable until a specified condition becomes false.
ru: Отбрасывать элементы Observable, пока указанное условие не станет ложным.

# skipWhileWithIndex
source: Discard items emitted by an Observable until a specified condition becomes false.
ru: Отбрасывать элементы Observable, пока указанное условие не станет ложным, отличие от skipWhile в том, что еще одним передаваем аргументов в функцию является индекс сгенерированного элемента.

# startWith
source: Emit a specified sequence of items before beginning to emit the items from the source Observable.
ru: В начало Observable добавляются элементы, переданные в качестве аргумента.

# switchLatest
source: Convert an Observable that emits Observables into a single Observable that emits the items emitted by the most-recently-emitted of those Observables.
ru: При нескольких Observable, дублирует элементы первого, когда второй начинает отправку элементов, то отбрасывает элементы первого и производит отписку, таким образов в финальный Observable получаем только элементы последнего Observable.

# take
source: Emit only the first n items emitted by an Observable.
ru: Emit'ит только первые n элементов Observable.

# takeDuration
source: Emit only the first n items emitted by an Observable.
ru: Emit'ит только первые n элементов Observable.

# takeLast
source: Emit only the final n items emitted by an Observable.
ru: Emit'ит только конечные n элементов Observable.

# takeUntil
source: Discard any items emitted by an Observable after a second Observable emits an item or terminates.
ru: Отбрасывать любые элементы, посылаемые Observable после того, как второй Observable посылает элемент или завершается.

# takeWhile
source: Mirror items emitted by an Observable until a specified condition becomes false.
ru: Дублирует элементы Observable, пока условие не станет ложным.

# takeWhileWithIndex
source: Mirror items emitted by an Observable until a specified condition becomes false.
ru: Дублирует элементы Observable, пока условие не станет ложным.

# throw
source: Create an Observable that emits no items and terminates with an error.
ru: Создайте Observable, который не выдает элементов и завершается с ошибкой.

# timeout
source: Mirror the source Observable, but issue an error notification if a particular period of time elapses without any emitted items.
ru: Дублирует элементы из Observable, но если в течение указанного времени Observable не сгенерировал ни одного элемента, генерирует ошибку.

# timer
source: Create an Observable that emits a particular item after a given delay.
ru: Создание Observable, который выдает определенный элемент после заданной задержки.

# toArray
source: Convert an Observable into another object or data structure.
ru: Преобразование Observable объекта в другой объект или структуру данных.

# zip
source: Combine the emissions of multiple Observables together via a specified function and emit single items for each combination based on the results of this function.
ru: Объедините элементы нескольких Observable с помощью определенной функции и выделите отдельные элементы для каждой комбинации на основе результатов этой функции.

source: Read
ru: Читать

source: more
ru: подробнее
